app/controllers/password_resets_controller.rb

  def find_user
    @user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "florian.popa@wolfpack-digital.com"], ["LIMIT", 1]]