app/controllers/products_controller.rb

    def create
        @product = Product.new(product_params)
        if @product.save
---
INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at", "vegetarian") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Burger smecher"], ["description", "Entrees"], ["price", 100.0], ["created_at", "2018-08-29 14:08:15.075843"], ["updated_at", "2018-08-29 14:08:15.075843"], ["vegetarian", "t"]]