app/controllers/static_pages_controller.rb

SELECT "products".* FROM "products"
SELECT "products".* FROM "products" ORDER BY "products"."price" DESC
SELECT "products".* FROM "products" WHERE "products"."vegetarian" = ?  [["vegetarian", "t"]]
---
  def home

    if !params[:type].nil?
      @products = Product.filtered(params[:type])
    elsif params[:sort_type] == "Ascending"
      @products = Product.all.sort{|a,b| return a<=>b}
    elsif params[:sort_type] == "Descending"
      @products = @products.order(price: :desc)
    elsif !params[:veg_type].nil?
      @products = Product.vegetarian
    else
      @products = Product.all