app/views/layouts/_products.html.haml

	.row
		- @products.each do |p|
			.col-md-3.product-item
---
SELECT "products".* FROM "products" WHERE (price > 0 AND price < 150)